article/linux-shared-memory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-12 Mon 21:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux 清理共享内存</title>
<meta name="author" content="Jinghui Hu" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Linux 清理共享内存</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org40e7b9f">1. 问题 QSharedMemory</a></li>
<li><a href="#org7362bba">2. 清理工具</a></li>
</ul>
</div>
</div>


<div id="outline-container-org40e7b9f" class="outline-2">
<h2 id="org40e7b9f"><span class="section-number-2">1.</span> 问题 QSharedMemory</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在编写 QT 应用时，发现程序异常退出 QSharedMemory 申请的内存还是会驻留
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">TdaApplication</span><span style="color: #8d5649;">(</span>QApplication<span style="color: #8d5649;">)</span>:

    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #51afef;">self</span>, *args, **kwargs<span style="color: #8d5649;">)</span>:
        <span style="color: #c678dd;">super</span><span style="color: #8d5649;">()</span>.__init__<span style="color: #8d5649;">(</span>*args, **kwargs<span style="color: #8d5649;">)</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">_shared_mem</span> = QSharedMemory<span style="color: #8d5649;">(</span>TDA_APPNAME<span style="color: #8d5649;">)</span>
        <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">_win</span> = QMainWindow<span style="color: #8d5649;">(</span>parent=<span style="color: #a9a1e1;">None</span><span style="color: #8d5649;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org7362bba" class="outline-2">
<h2 id="org7362bba"><span class="section-number-2">2.</span> 清理工具</h2>
<div class="outline-text-2" id="text-2">
<p>
可以使用 ipcs/ipcrm 工具手工清理对应内存地址，具体示例如下：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ipcs -m

------ Shared Memory Segments --------
key        shmid      owner      perms      bytes      nattch     status
0x00000000 16         jhh        606        11436552   2          dest
0x00000000 17         jhh        606        11436552   2          dest
0x512034dc 32797      jhh        600        1          0

$ ipcrm -M 0x512034dc
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2025-05-12 Mon 21:53. Created by Jinghui Hu at 2025-05-09 Fri 00:00.</p>
</div>
</body>
</html>
